GopalSaraf/Practicals/PSDL/include/proc/pic16lf19196.h
extern volatile INLVLGbits_t INLVLGbits __at(0x1E5F);
// bitfield macros
#define _INLVLG_INLVLG0_POSN                                0x0
#define _INLVLG_INLVLG0_POSITION                            0x0
#define _INLVLG_INLVLG0_SIZE                                0x1
#define _INLVLG_INLVLG0_LENGTH                              0x1
#define _INLVLG_INLVLG0_MASK                                0x1
#define _INLVLG_INLVLG1_POSN                                0x1
#define _INLVLG_INLVLG1_POSITION                            0x1
#define _INLVLG_INLVLG1_SIZE                                0x1
#define _INLVLG_INLVLG1_LENGTH                              0x1
#define _INLVLG_INLVLG1_MASK                                0x2
#define _INLVLG_INLVLG2_POSN                                0x2
#define _INLVLG_INLVLG2_POSITION                            0x2
#define _INLVLG_INLVLG2_SIZE                                0x1
#define _INLVLG_INLVLG2_LENGTH                              0x1
#define _INLVLG_INLVLG2_MASK                                0x4
#define _INLVLG_INLVLG3_POSN                                0x3
#define _INLVLG_INLVLG3_POSITION                            0x3
#define _INLVLG_INLVLG3_SIZE                                0x1
#define _INLVLG_INLVLG3_LENGTH                              0x1
#define _INLVLG_INLVLG3_MASK                                0x8
#define _INLVLG_INLVLG4_POSN                                0x4
#define _INLVLG_INLVLG4_POSITION                            0x4
#define _INLVLG_INLVLG4_SIZE                                0x1
#define _INLVLG_INLVLG4_LENGTH                              0x1
#define _INLVLG_INLVLG4_MASK                                0x10
#define _INLVLG_INLVLG5_POSN                                0x5
#define _INLVLG_INLVLG5_POSITION                            0x5
#define _INLVLG_INLVLG5_SIZE                                0x1
#define _INLVLG_INLVLG5_LENGTH                              0x1
#define _INLVLG_INLVLG5_MASK                                0x20
#define _INLVLG_INLVLG6_POSN                                0x6
#define _INLVLG_INLVLG6_POSITION                            0x6
#define _INLVLG_INLVLG6_SIZE                                0x1
#define _INLVLG_INLVLG6_LENGTH                              0x1
#define _INLVLG_INLVLG6_MASK                                0x40
#define _INLVLG_INLVLG7_POSN                                0x7
#define _INLVLG_INLVLG7_POSITION                            0x7
#define _INLVLG_INLVLG7_SIZE                                0x1
#define _INLVLG_INLVLG7_LENGTH                              0x1
#define _INLVLG_INLVLG7_MASK                                0x80

// Register: IOCGP
#define IOCGP IOCGP
extern volatile unsigned char           IOCGP               __at(0x1E60);
#ifndef _LIB_BUILD
asm("IOCGP equ 01E60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned IOCGP5                 :1;
    };
} IOCGPbits_t;
extern volatile IOCGPbits_t IOCGPbits __at(0x1E60);
// bitfield macros
#define _IOCGP_IOCGP5_POSN                                  0x5
#define _IOCGP_IOCGP5_POSITION                              0x5
#define _IOCGP_IOCGP5_SIZE                                  0x1
#define _IOCGP_IOCGP5_LENGTH                                0x1
#define _IOCGP_IOCGP5_MASK                                  0x20

// Register: IOCGN
#define IOCGN IOCGN
extern volatile unsigned char           IOCGN               __at(0x1E61);
#ifndef _LIB_BUILD
asm("IOCGN equ 01E61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned IOCGN5                 :1;
    };
} IOCGNbits_t;
extern volatile IOCGNbits_t IOCGNbits __at(0x1E61);
// bitfield macros
#define _IOCGN_IOCGN5_POSN                                  0x5
#define _IOCGN_IOCGN5_POSITION                              0x5
#define _IOCGN_IOCGN5_SIZE                                  0x1
#define _IOCGN_IOCGN5_LENGTH                                0x1
#define _IOCGN_IOCGN5_MASK                                  0x20

// Register: IOCGF
#define IOCGF IOCGF
extern volatile unsigned char           IOCGF               __at(0x1E62);
#ifndef _LIB_BUILD
asm("IOCGF equ 01E62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :5;
        unsigned IOCGF5                 :1;
    };
} IOCGFbits_t;
extern volatile IOCGFbits_t IOCGFbits __at(0x1E62);
// bitfield macros
#define _IOCGF_IOCGF5_POSN                                  0x5
#define _IOCGF_IOCGF5_POSITION                              0x5
#define _IOCGF_IOCGF5_SIZE                                  0x1
#define _IOCGF_IOCGF5_LENGTH                                0x1
#define _IOCGF_IOCGF5_MASK                                  0x20

// Register: ANSELH
#define ANSELH ANSELH
extern volatile unsigned char           ANSELH              __at(0x1E66);
#ifndef _LIB_BUILD
asm("ANSELH equ 01E66h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELH0                :1;
        unsigned ANSELH1                :1;
        unsigned ANSELH2                :1;
        unsigned ANSELH3                :1;
    };
} ANSELHbits_t;
extern volatile ANSELHbits_t ANSELHbits __at(0x1E66);
// bitfield macros
#define _ANSELH_ANSELH0_POSN                                0x0
#define _ANSELH_ANSELH0_POSITION                            0x0
#define _ANSELH_ANSELH0_SIZE                                0x1
#define _ANSELH_ANSELH0_LENGTH                              0x1
#define _ANSELH_ANSELH0_MASK                                0x1
#define _ANSELH_ANSELH1_POSN                                0x1
#define _ANSELH_ANSELH1_POSITION                            0x1
#define _ANSELH_ANSELH1_SIZE                                0x1
#define _ANSELH_ANSELH1_LENGTH                              0x1
#define _ANSELH_ANSELH1_MASK                                0x2
#define _ANSELH_ANSELH2_POSN                                0x2
#define _ANSELH_ANSELH2_POSITION                            0x2
#define _ANSELH_ANSELH2_SIZE                                0x1
#define _ANSELH_ANSELH2_LENGTH                              0x1
#define _ANSELH_ANSELH2_MASK                                0x4
#define _ANSELH_ANSELH3_POSN                                0x3
#define _ANSELH_ANSELH3_POSITION                            0x3
#define _ANSELH_ANSELH3_SIZE                                0x1
#define _ANSELH_ANSELH3_LENGTH                              0x1
#define _ANSELH_ANSELH3_MASK                                0x8

