GopalSaraf/Practicals/PSDL/include/proc/pic16lf19196.h
extern volatile __bit                   INLVLB4             __at(0xFA3C);	// @ (0x1F47 * 8 + 4)
#define                                 INLVLB4_bit         _BIT_ACCESS(INLVLB,4)
// INLVLB<INLVLB5>
extern volatile __bit                   INLVLB5             __at(0xFA3D);	// @ (0x1F47 * 8 + 5)
#define                                 INLVLB5_bit         _BIT_ACCESS(INLVLB,5)
// INLVLB<INLVLB6>
extern volatile __bit                   INLVLB6             __at(0xFA3E);	// @ (0x1F47 * 8 + 6)
#define                                 INLVLB6_bit         _BIT_ACCESS(INLVLB,6)
// INLVLB<INLVLB7>
extern volatile __bit                   INLVLB7             __at(0xFA3F);	// @ (0x1F47 * 8 + 7)
#define                                 INLVLB7_bit         _BIT_ACCESS(INLVLB,7)
// INLVLC<INLVLC0>
extern volatile __bit                   INLVLC0             __at(0xFA90);	// @ (0x1F52 * 8 + 0)
#define                                 INLVLC0_bit         _BIT_ACCESS(INLVLC,0)
// INLVLC<INLVLC1>
extern volatile __bit                   INLVLC1             __at(0xFA91);	// @ (0x1F52 * 8 + 1)
#define                                 INLVLC1_bit         _BIT_ACCESS(INLVLC,1)
// INLVLC<INLVLC2>
extern volatile __bit                   INLVLC2             __at(0xFA92);	// @ (0x1F52 * 8 + 2)
#define                                 INLVLC2_bit         _BIT_ACCESS(INLVLC,2)
// INLVLC<INLVLC3>
extern volatile __bit                   INLVLC3             __at(0xFA93);	// @ (0x1F52 * 8 + 3)
#define                                 INLVLC3_bit         _BIT_ACCESS(INLVLC,3)
// INLVLC<INLVLC4>
extern volatile __bit                   INLVLC4             __at(0xFA94);	// @ (0x1F52 * 8 + 4)
#define                                 INLVLC4_bit         _BIT_ACCESS(INLVLC,4)
// INLVLC<INLVLC5>
extern volatile __bit                   INLVLC5             __at(0xFA95);	// @ (0x1F52 * 8 + 5)
#define                                 INLVLC5_bit         _BIT_ACCESS(INLVLC,5)
// INLVLC<INLVLC6>
extern volatile __bit                   INLVLC6             __at(0xFA96);	// @ (0x1F52 * 8 + 6)
#define                                 INLVLC6_bit         _BIT_ACCESS(INLVLC,6)
// INLVLC<INLVLC7>
extern volatile __bit                   INLVLC7             __at(0xFA97);	// @ (0x1F52 * 8 + 7)
#define                                 INLVLC7_bit         _BIT_ACCESS(INLVLC,7)
// INLVLD<INLVLD0>
extern volatile __bit                   INLVLD0             __at(0xFAE8);	// @ (0x1F5D * 8 + 0)
#define                                 INLVLD0_bit         _BIT_ACCESS(INLVLD,0)
// INLVLD<INLVLD1>
extern volatile __bit                   INLVLD1             __at(0xFAE9);	// @ (0x1F5D * 8 + 1)
#define                                 INLVLD1_bit         _BIT_ACCESS(INLVLD,1)
// INLVLD<INLVLD2>
extern volatile __bit                   INLVLD2             __at(0xFAEA);	// @ (0x1F5D * 8 + 2)
#define                                 INLVLD2_bit         _BIT_ACCESS(INLVLD,2)
// INLVLD<INLVLD3>
extern volatile __bit                   INLVLD3             __at(0xFAEB);	// @ (0x1F5D * 8 + 3)
#define                                 INLVLD3_bit         _BIT_ACCESS(INLVLD,3)
// INLVLD<INLVLD4>
extern volatile __bit                   INLVLD4             __at(0xFAEC);	// @ (0x1F5D * 8 + 4)
#define                                 INLVLD4_bit         _BIT_ACCESS(INLVLD,4)
// INLVLD<INLVLD5>
extern volatile __bit                   INLVLD5             __at(0xFAED);	// @ (0x1F5D * 8 + 5)
#define                                 INLVLD5_bit         _BIT_ACCESS(INLVLD,5)
// INLVLD<INLVLD6>
extern volatile __bit                   INLVLD6             __at(0xFAEE);	// @ (0x1F5D * 8 + 6)
#define                                 INLVLD6_bit         _BIT_ACCESS(INLVLD,6)
// INLVLD<INLVLD7>
extern volatile __bit                   INLVLD7             __at(0xFAEF);	// @ (0x1F5D * 8 + 7)
#define                                 INLVLD7_bit         _BIT_ACCESS(INLVLD,7)
// INLVLE<INLVLE0>
extern volatile __bit                   INLVLE0             __at(0xFB40);	// @ (0x1F68 * 8 + 0)
#define                                 INLVLE0_bit         _BIT_ACCESS(INLVLE,0)
// INLVLE<INLVLE1>
extern volatile __bit                   INLVLE1             __at(0xFB41);	// @ (0x1F68 * 8 + 1)
#define                                 INLVLE1_bit         _BIT_ACCESS(INLVLE,1)
// INLVLE<INLVLE3>
extern volatile __bit                   INLVLE3             __at(0xFB43);	// @ (0x1F68 * 8 + 3)
#define                                 INLVLE3_bit         _BIT_ACCESS(INLVLE,3)
// INLVLE<INLVLE4>
extern volatile __bit                   INLVLE4             __at(0xFB44);	// @ (0x1F68 * 8 + 4)
#define                                 INLVLE4_bit         _BIT_ACCESS(INLVLE,4)
// INLVLE<INLVLE5>
extern volatile __bit                   INLVLE5             __at(0xFB45);	// @ (0x1F68 * 8 + 5)
#define                                 INLVLE5_bit         _BIT_ACCESS(INLVLE,5)
// INLVLE<INLVLE6>
extern volatile __bit                   INLVLE6             __at(0xFB46);	// @ (0x1F68 * 8 + 6)
#define                                 INLVLE6_bit         _BIT_ACCESS(INLVLE,6)
// INLVLE<INLVLE7>
extern volatile __bit                   INLVLE7             __at(0xFB47);	// @ (0x1F68 * 8 + 7)
#define                                 INLVLE7_bit         _BIT_ACCESS(INLVLE,7)
// INLVLF<INLVLF0>
extern volatile __bit                   INLVLF0             __at(0xF2A0);	// @ (0x1E54 * 8 + 0)
#define                                 INLVLF0_bit         _BIT_ACCESS(INLVLF,0)
// INLVLF<INLVLF1>
extern volatile __bit                   INLVLF1             __at(0xF2A1);	// @ (0x1E54 * 8 + 1)
#define                                 INLVLF1_bit         _BIT_ACCESS(INLVLF,1)
// INLVLF<INLVLF2>
extern volatile __bit                   INLVLF2             __at(0xF2A2);	// @ (0x1E54 * 8 + 2)
#define                                 INLVLF2_bit         _BIT_ACCESS(INLVLF,2)
// INLVLF<INLVLF3>
extern volatile __bit                   INLVLF3             __at(0xF2A3);	// @ (0x1E54 * 8 + 3)
#define                                 INLVLF3_bit         _BIT_ACCESS(INLVLF,3)
// INLVLF<INLVLF4>
extern volatile __bit                   INLVLF4             __at(0xF2A4);	// @ (0x1E54 * 8 + 4)
#define                                 INLVLF4_bit         _BIT_ACCESS(INLVLF,4)
// INLVLF<INLVLF5>
extern volatile __bit                   INLVLF5             __at(0xF2A5);	// @ (0x1E54 * 8 + 5)
#define                                 INLVLF5_bit         _BIT_ACCESS(INLVLF,5)
// INLVLF<INLVLF6>
extern volatile __bit                   INLVLF6             __at(0xF2A6);	// @ (0x1E54 * 8 + 6)
#define                                 INLVLF6_bit         _BIT_ACCESS(INLVLF,6)
// INLVLF<INLVLF7>
extern volatile __bit                   INLVLF7             __at(0xF2A7);	// @ (0x1E54 * 8 + 7)
#define                                 INLVLF7_bit         _BIT_ACCESS(INLVLF,7)
// INLVLG<INLVLG0>
extern volatile __bit                   INLVLG0             __at(0xF2F8);	// @ (0x1E5F * 8 + 0)
#define                                 INLVLG0_bit         _BIT_ACCESS(INLVLG,0)
// INLVLG<INLVLG1>
extern volatile __bit                   INLVLG1             __at(0xF2F9);	// @ (0x1E5F * 8 + 1)
#define                                 INLVLG1_bit         _BIT_ACCESS(INLVLG,1)
// INLVLG<INLVLG2>
extern volatile __bit                   INLVLG2             __at(0xF2FA);	// @ (0x1E5F * 8 + 2)
#define                                 INLVLG2_bit         _BIT_ACCESS(INLVLG,2)
// INLVLG<INLVLG3>
extern volatile __bit                   INLVLG3             __at(0xF2FB);	// @ (0x1E5F * 8 + 3)
#define                                 INLVLG3_bit         _BIT_ACCESS(INLVLG,3)
// INLVLG<INLVLG4>
extern volatile __bit                   INLVLG4             __at(0xF2FC);	// @ (0x1E5F * 8 + 4)
#define                                 INLVLG4_bit         _BIT_ACCESS(INLVLG,4)
// INLVLG<INLVLG5>
extern volatile __bit                   INLVLG5             __at(0xF2FD);	// @ (0x1E5F * 8 + 5)
#define                                 INLVLG5_bit         _BIT_ACCESS(INLVLG,5)
// INLVLG<INLVLG6>
extern volatile __bit                   INLVLG6             __at(0xF2FE);	// @ (0x1E5F * 8 + 6)
#define                                 INLVLG6_bit         _BIT_ACCESS(INLVLG,6)
// INLVLG<INLVLG7>
extern volatile __bit                   INLVLG7             __at(0xF2FF);	// @ (0x1E5F * 8 + 7)
#define                                 INLVLG7_bit         _BIT_ACCESS(INLVLG,7)
// INLVLH<INLVLH0>
extern volatile __bit                   INLVLH0             __at(0xF350);	// @ (0x1E6A * 8 + 0)
#define                                 INLVLH0_bit         _BIT_ACCESS(INLVLH,0)
// INLVLH<INLVLH1>
extern volatile __bit                   INLVLH1             __at(0xF351);	// @ (0x1E6A * 8 + 1)
#define                                 INLVLH1_bit         _BIT_ACCESS(INLVLH,1)
// INLVLH<INLVLH2>
extern volatile __bit                   INLVLH2             __at(0xF352);	// @ (0x1E6A * 8 + 2)
#define                                 INLVLH2_bit         _BIT_ACCESS(INLVLH,2)
// INLVLH<INLVLH3>
extern volatile __bit                   INLVLH3             __at(0xF353);	// @ (0x1E6A * 8 + 3)
#define                                 INLVLH3_bit         _BIT_ACCESS(INLVLH,3)
// PIE0<INTE>
extern volatile __bit                   INTE                __at(0x38B0);	// @ (0x716 * 8 + 0)
#define                                 INTE_bit            _BIT_ACCESS(PIE0,0)
// INTCON<INTEDG>
extern volatile __bit                   INTEDG              __at(0x58);	// @ (0xB * 8 + 0)
#define                                 INTEDG_bit          _BIT_ACCESS(INTCON,0)
// PIR0<INTF>
extern volatile __bit                   INTF                __at(0x3860);	// @ (0x70C * 8 + 0)
#define                                 INTF_bit            _BIT_ACCESS(PIR0,0)
// INTPPS<INTPPS0>
extern volatile __bit                   INTPPS0             __at(0xF480);	// @ (0x1E90 * 8 + 0)
#define                                 INTPPS0_bit         _BIT_ACCESS(INTPPS,0)
// INTPPS<INTPPS1>
extern volatile __bit                   INTPPS1             __at(0xF481);	// @ (0x1E90 * 8 + 1)
#define                                 INTPPS1_bit         _BIT_ACCESS(INTPPS,1)
// INTPPS<INTPPS2>
extern volatile __bit                   INTPPS2             __at(0xF482);	// @ (0x1E90 * 8 + 2)
#define                                 INTPPS2_bit         _BIT_ACCESS(INTPPS,2)
// INTPPS<INTPPS3>
extern volatile __bit                   INTPPS3             __at(0xF483);	// @ (0x1E90 * 8 + 3)
#define                                 INTPPS3_bit         _BIT_ACCESS(INTPPS,3)
// INTPPS<INTPPS4>
extern volatile __bit                   INTPPS4             __at(0xF484);	// @ (0x1E90 * 8 + 4)
#define                                 INTPPS4_bit         _BIT_ACCESS(INTPPS,4)
// IOCBF<IOCBF0>
extern volatile __bit                   IOCBF0              __at(0xFA50);	// @ (0x1F4A * 8 + 0)
#define                                 IOCBF0_bit          _BIT_ACCESS(IOCBF,0)
// IOCBF<IOCBF1>
extern volatile __bit                   IOCBF1              __at(0xFA51);	// @ (0x1F4A * 8 + 1)
#define                                 IOCBF1_bit          _BIT_ACCESS(IOCBF,1)
// IOCBF<IOCBF2>
extern volatile __bit                   IOCBF2              __at(0xFA52);	// @ (0x1F4A * 8 + 2)
#define                                 IOCBF2_bit          _BIT_ACCESS(IOCBF,2)
// IOCBF<IOCBF3>
extern volatile __bit                   IOCBF3              __at(0xFA53);	// @ (0x1F4A * 8 + 3)
#define                                 IOCBF3_bit          _BIT_ACCESS(IOCBF,3)
// IOCBF<IOCBF4>
extern volatile __bit                   IOCBF4              __at(0xFA54);	// @ (0x1F4A * 8 + 4)
#define                                 IOCBF4_bit          _BIT_ACCESS(IOCBF,4)
// IOCBF<IOCBF5>
extern volatile __bit                   IOCBF5              __at(0xFA55);	// @ (0x1F4A * 8 + 5)
#define                                 IOCBF5_bit          _BIT_ACCESS(IOCBF,5)
// IOCBF<IOCBF6>
extern volatile __bit                   IOCBF6              __at(0xFA56);	// @ (0x1F4A * 8 + 6)
#define                                 IOCBF6_bit          _BIT_ACCESS(IOCBF,6)
// IOCBF<IOCBF7>
extern volatile __bit                   IOCBF7              __at(0xFA57);	// @ (0x1F4A * 8 + 7)
#define                                 IOCBF7_bit          _BIT_ACCESS(IOCBF,7)
// IOCBN<IOCBN0>
extern volatile __bit                   IOCBN0              __at(0xFA48);	// @ (0x1F49 * 8 + 0)
#define                                 IOCBN0_bit          _BIT_ACCESS(IOCBN,0)
// IOCBN<IOCBN1>
extern volatile __bit                   IOCBN1              __at(0xFA49);	// @ (0x1F49 * 8 + 1)
#define                                 IOCBN1_bit          _BIT_ACCESS(IOCBN,1)
// IOCBN<IOCBN2>
extern volatile __bit                   IOCBN2              __at(0xFA4A);	// @ (0x1F49 * 8 + 2)
#define                                 IOCBN2_bit          _BIT_ACCESS(IOCBN,2)
// IOCBN<IOCBN3>
extern volatile __bit                   IOCBN3              __at(0xFA4B);	// @ (0x1F49 * 8 + 3)
#define                                 IOCBN3_bit          _BIT_ACCESS(IOCBN,3)
// IOCBN<IOCBN4>
extern volatile __bit                   IOCBN4              __at(0xFA4C);	// @ (0x1F49 * 8 + 4)
#define                                 IOCBN4_bit          _BIT_ACCESS(IOCBN,4)
// IOCBN<IOCBN5>
extern volatile __bit                   IOCBN5              __at(0xFA4D);	// @ (0x1F49 * 8 + 5)
#define                                 IOCBN5_bit          _BIT_ACCESS(IOCBN,5)
// IOCBN<IOCBN6>
extern volatile __bit                   IOCBN6              __at(0xFA4E);	// @ (0x1F49 * 8 + 6)
#define                                 IOCBN6_bit          _BIT_ACCESS(IOCBN,6)
// IOCBN<IOCBN7>
extern volatile __bit                   IOCBN7              __at(0xFA4F);	// @ (0x1F49 * 8 + 7)
#define                                 IOCBN7_bit          _BIT_ACCESS(IOCBN,7)
// IOCBP<IOCBP0>
extern volatile __bit                   IOCBP0              __at(0xFA40);	// @ (0x1F48 * 8 + 0)
#define                                 IOCBP0_bit          _BIT_ACCESS(IOCBP,0)
// IOCBP<IOCBP1>
extern volatile __bit                   IOCBP1              __at(0xFA41);	// @ (0x1F48 * 8 + 1)
#define                                 IOCBP1_bit          _BIT_ACCESS(IOCBP,1)
// IOCBP<IOCBP2>
extern volatile __bit                   IOCBP2              __at(0xFA42);	// @ (0x1F48 * 8 + 2)
#define                                 IOCBP2_bit          _BIT_ACCESS(IOCBP,2)
// IOCBP<IOCBP3>
extern volatile __bit                   IOCBP3              __at(0xFA43);	// @ (0x1F48 * 8 + 3)
#define                                 IOCBP3_bit          _BIT_ACCESS(IOCBP,3)
// IOCBP<IOCBP4>
extern volatile __bit                   IOCBP4              __at(0xFA44);	// @ (0x1F48 * 8 + 4)
#define                                 IOCBP4_bit          _BIT_ACCESS(IOCBP,4)
// IOCBP<IOCBP5>
extern volatile __bit                   IOCBP5              __at(0xFA45);	// @ (0x1F48 * 8 + 5)
#define                                 IOCBP5_bit          _BIT_ACCESS(IOCBP,5)
// IOCBP<IOCBP6>
extern volatile __bit                   IOCBP6              __at(0xFA46);	// @ (0x1F48 * 8 + 6)
#define                                 IOCBP6_bit          _BIT_ACCESS(IOCBP,6)
// IOCBP<IOCBP7>
extern volatile __bit                   IOCBP7              __at(0xFA47);	// @ (0x1F48 * 8 + 7)
#define                                 IOCBP7_bit          _BIT_ACCESS(IOCBP,7)
// IOCCF<IOCCF0>
extern volatile __bit                   IOCCF0              __at(0xFAA8);	// @ (0x1F55 * 8 + 0)
#define                                 IOCCF0_bit          _BIT_ACCESS(IOCCF,0)
// IOCCF<IOCCF1>
extern volatile __bit                   IOCCF1              __at(0xFAA9);	// @ (0x1F55 * 8 + 1)
#define                                 IOCCF1_bit          _BIT_ACCESS(IOCCF,1)
// IOCCF<IOCCF2>
extern volatile __bit                   IOCCF2              __at(0xFAAA);	// @ (0x1F55 * 8 + 2)
#define                                 IOCCF2_bit          _BIT_ACCESS(IOCCF,2)
// IOCCF<IOCCF3>
extern volatile __bit                   IOCCF3              __at(0xFAAB);	// @ (0x1F55 * 8 + 3)
#define                                 IOCCF3_bit          _BIT_ACCESS(IOCCF,3)
// IOCCF<IOCCF4>
extern volatile __bit                   IOCCF4              __at(0xFAAC);	// @ (0x1F55 * 8 + 4)
#define                                 IOCCF4_bit          _BIT_ACCESS(IOCCF,4)
// IOCCF<IOCCF5>
extern volatile __bit                   IOCCF5              __at(0xFAAD);	// @ (0x1F55 * 8 + 5)
#define                                 IOCCF5_bit          _BIT_ACCESS(IOCCF,5)
// IOCCF<IOCCF6>
extern volatile __bit                   IOCCF6              __at(0xFAAE);	// @ (0x1F55 * 8 + 6)
#define                                 IOCCF6_bit          _BIT_ACCESS(IOCCF,6)
// IOCCF<IOCCF7>
extern volatile __bit                   IOCCF7              __at(0xFAAF);	// @ (0x1F55 * 8 + 7)
#define                                 IOCCF7_bit          _BIT_ACCESS(IOCCF,7)
// IOCCN<IOCCN0>
extern volatile __bit                   IOCCN0              __at(0xFAA0);	// @ (0x1F54 * 8 + 0)
#define                                 IOCCN0_bit          _BIT_ACCESS(IOCCN,0)
// IOCCN<IOCCN1>
extern volatile __bit                   IOCCN1              __at(0xFAA1);	// @ (0x1F54 * 8 + 1)
#define                                 IOCCN1_bit          _BIT_ACCESS(IOCCN,1)
// IOCCN<IOCCN2>
extern volatile __bit                   IOCCN2              __at(0xFAA2);	// @ (0x1F54 * 8 + 2)
#define                                 IOCCN2_bit          _BIT_ACCESS(IOCCN,2)
// IOCCN<IOCCN3>
extern volatile __bit                   IOCCN3              __at(0xFAA3);	// @ (0x1F54 * 8 + 3)
#define                                 IOCCN3_bit          _BIT_ACCESS(IOCCN,3)
// IOCCN<IOCCN4>
extern volatile __bit                   IOCCN4              __at(0xFAA4);	// @ (0x1F54 * 8 + 4)
#define                                 IOCCN4_bit          _BIT_ACCESS(IOCCN,4)
// IOCCN<IOCCN5>
extern volatile __bit                   IOCCN5              __at(0xFAA5);	// @ (0x1F54 * 8 + 5)
#define                                 IOCCN5_bit          _BIT_ACCESS(IOCCN,5)
// IOCCN<IOCCN6>
extern volatile __bit                   IOCCN6              __at(0xFAA6);	// @ (0x1F54 * 8 + 6)
#define                                 IOCCN6_bit          _BIT_ACCESS(IOCCN,6)
// IOCCN<IOCCN7>
extern volatile __bit                   IOCCN7              __at(0xFAA7);	// @ (0x1F54 * 8 + 7)
#define                                 IOCCN7_bit          _BIT_ACCESS(IOCCN,7)
// IOCCP<IOCCP0>
extern volatile __bit                   IOCCP0              __at(0xFA98);	// @ (0x1F53 * 8 + 0)
#define                                 IOCCP0_bit          _BIT_ACCESS(IOCCP,0)
// IOCCP<IOCCP1>
extern volatile __bit                   IOCCP1              __at(0xFA99);	// @ (0x1F53 * 8 + 1)
#define                                 IOCCP1_bit          _BIT_ACCESS(IOCCP,1)
// IOCCP<IOCCP2>
extern volatile __bit                   IOCCP2              __at(0xFA9A);	// @ (0x1F53 * 8 + 2)
#define                                 IOCCP2_bit          _BIT_ACCESS(IOCCP,2)
// IOCCP<IOCCP3>
extern volatile __bit                   IOCCP3              __at(0xFA9B);	// @ (0x1F53 * 8 + 3)
#define                                 IOCCP3_bit          _BIT_ACCESS(IOCCP,3)
// IOCCP<IOCCP4>
extern volatile __bit                   IOCCP4              __at(0xFA9C);	// @ (0x1F53 * 8 + 4)
#define                                 IOCCP4_bit          _BIT_ACCESS(IOCCP,4)
// IOCCP<IOCCP5>
extern volatile __bit                   IOCCP5              __at(0xFA9D);	// @ (0x1F53 * 8 + 5)
#define                                 IOCCP5_bit          _BIT_ACCESS(IOCCP,5)
// IOCCP<IOCCP6>
extern volatile __bit                   IOCCP6              __at(0xFA9E);	// @ (0x1F53 * 8 + 6)
#define                                 IOCCP6_bit          _BIT_ACCESS(IOCCP,6)
// IOCCP<IOCCP7>
extern volatile __bit                   IOCCP7              __at(0xFA9F);	// @ (0x1F53 * 8 + 7)
#define                                 IOCCP7_bit          _BIT_ACCESS(IOCCP,7)
// IOCEF<IOCEF0>
extern volatile __bit                   IOCEF0              __at(0xFB58);	// @ (0x1F6B * 8 + 0)
#define                                 IOCEF0_bit          _BIT_ACCESS(IOCEF,0)
// IOCEF<IOCEF1>
extern volatile __bit                   IOCEF1              __at(0xFB59);	// @ (0x1F6B * 8 + 1)
#define                                 IOCEF1_bit          _BIT_ACCESS(IOCEF,1)
// IOCEF<IOCEF2>
extern volatile __bit                   IOCEF2              __at(0xFB5A);	// @ (0x1F6B * 8 + 2)
#define                                 IOCEF2_bit          _BIT_ACCESS(IOCEF,2)
// IOCEF<IOCEF3>
extern volatile __bit                   IOCEF3              __at(0xFB5B);	// @ (0x1F6B * 8 + 3)
#define                                 IOCEF3_bit          _BIT_ACCESS(IOCEF,3)
// IOCEF<IOCEF4>
extern volatile __bit                   IOCEF4              __at(0xFB5C);	// @ (0x1F6B * 8 + 4)
#define                                 IOCEF4_bit          _BIT_ACCESS(IOCEF,4)
// IOCEF<IOCEF5>
extern volatile __bit                   IOCEF5              __at(0xFB5D);	// @ (0x1F6B * 8 + 5)
#define                                 IOCEF5_bit          _BIT_ACCESS(IOCEF,5)
// IOCEF<IOCEF6>
extern volatile __bit                   IOCEF6              __at(0xFB5E);	// @ (0x1F6B * 8 + 6)
#define                                 IOCEF6_bit          _BIT_ACCESS(IOCEF,6)
// IOCEF<IOCEF7>
extern volatile __bit                   IOCEF7              __at(0xFB5F);	// @ (0x1F6B * 8 + 7)
#define                                 IOCEF7_bit          _BIT_ACCESS(IOCEF,7)
// IOCEN<IOCEN0>
extern volatile __bit                   IOCEN0              __at(0xFB50);	// @ (0x1F6A * 8 + 0)
#define                                 IOCEN0_bit          _BIT_ACCESS(IOCEN,0)
// IOCEN<IOCEN1>
extern volatile __bit                   IOCEN1              __at(0xFB51);	// @ (0x1F6A * 8 + 1)
#define                                 IOCEN1_bit          _BIT_ACCESS(IOCEN,1)
// IOCEN<IOCEN2>
extern volatile __bit                   IOCEN2              __at(0xFB52);	// @ (0x1F6A * 8 + 2)
#define                                 IOCEN2_bit          _BIT_ACCESS(IOCEN,2)
// IOCEN<IOCEN3>
extern volatile __bit                   IOCEN3              __at(0xFB53);	// @ (0x1F6A * 8 + 3)
#define                                 IOCEN3_bit          _BIT_ACCESS(IOCEN,3)
// IOCEN<IOCEN4>
extern volatile __bit                   IOCEN4              __at(0xFB54);	// @ (0x1F6A * 8 + 4)
#define                                 IOCEN4_bit          _BIT_ACCESS(IOCEN,4)
// IOCEN<IOCEN5>
extern volatile __bit                   IOCEN5              __at(0xFB55);	// @ (0x1F6A * 8 + 5)
#define                                 IOCEN5_bit          _BIT_ACCESS(IOCEN,5)
// IOCEN<IOCEN6>
extern volatile __bit                   IOCEN6              __at(0xFB56);	// @ (0x1F6A * 8 + 6)
#define                                 IOCEN6_bit          _BIT_ACCESS(IOCEN,6)
// IOCEN<IOCEN7>
extern volatile __bit                   IOCEN7              __at(0xFB57);	// @ (0x1F6A * 8 + 7)
#define                                 IOCEN7_bit          _BIT_ACCESS(IOCEN,7)
// IOCEP<IOCEP0>
extern volatile __bit                   IOCEP0              __at(0xFB48);	// @ (0x1F69 * 8 + 0)
#define                                 IOCEP0_bit          _BIT_ACCESS(IOCEP,0)
// IOCEP<IOCEP1>
extern volatile __bit                   IOCEP1              __at(0xFB49);	// @ (0x1F69 * 8 + 1)
#define                                 IOCEP1_bit          _BIT_ACCESS(IOCEP,1)
// IOCEP<IOCEP2>
extern volatile __bit                   IOCEP2              __at(0xFB4A);	// @ (0x1F69 * 8 + 2)
#define                                 IOCEP2_bit          _BIT_ACCESS(IOCEP,2)
// IOCEP<IOCEP3>
extern volatile __bit                   IOCEP3              __at(0xFB4B);	// @ (0x1F69 * 8 + 3)
#define                                 IOCEP3_bit          _BIT_ACCESS(IOCEP,3)
